src/test/resources/event-yearly-subscription-deactivate.json

{
  "events": [
    {
      "id": "KA9tFTrRRHKDWTYdUUe0VQ",
      "processed": false,
      "created": 1554730518071,
      "type": "subscription.deactivated",
      "live": false,
      "data": {
        "id": "AFAkVOi0SSix63cXJAbIfg",
        "subscription": "AFAkVOi0SSix63cXJAbIfg",
        "active": false,
        "state": "deactivated",
        "changed": 1554730518066,
        "changedValue": 1554730518066,
        "changedInSeconds": 1554730518,
        "changedDisplay": "4/8/19",
        "live": false,
        "currency": "EUR",
        "account": {
          "id": "Th6JqSnZTdCSqqBxibhB7Q",
          "account": "Th6JqSnZTdCSqqBxibhB7Q",
          "contact": {
            "first": "john",
            "last": "doe",
            "email": "abc@xyz.com",
            "company": null,
            "phone": "123456"
          },
          "language": "en",
          "country": "RS",
          "lookup": {
            "global": "FYS617qSQqaBytq-D1gHZg"
          },
          "url": "https://falcon.test.onfastspring.com/account"
        },
        "product": {
          "product": "falcon-plus-annual-subscription-individual-license",
          "parent": null,
          "display": {
            "en": "Falcon Plus Annual Subscription"
          },
          "description": {
            "summary": {
              "en": "Annual Falcon Plus subscription for individual customers. "
            }
          },
          "image": "https://d8y8nchqlnmka.cloudfront.net/_RvXNGiNQBE/iNKuvT8uQ6k/falcon-tiger.png",
          "fulfillments": {},
          "format": "digital",
          "pricing": {
            "renew": "auto",
            "interval": "year",
            "intervalLength": 1,
            "intervalCount": null,
            "quantityBehavior": "lock",
            "quantityDefault": 1,
            "price": {
              "USD": 108
            },
            "quantityDiscounts": {
              "1": 100
            },
            "dateLimitsEnabled": false,
            "discountDuration": 1,
            "reminderNotification": {
              "enabled": true,
              "interval": "month",
              "intervalLength": 1
            },
            "overdueNotification": {
              "enabled": true,
              "interval": "week",
              "intervalLength": 1,
              "amount": 4
            },
            "cancellation": {
              "interval": "week",
              "intervalLength": 1
            }
          }
        },
        "sku": null,
        "display": "Falcon Plus Annual Subscription",
        "quantity": 1,
        "adhoc": false,
        "autoRenew": true,
        "price": 100,
        "priceDisplay": "€100.00",
        "priceInPayoutCurrency": 108.28,
        "priceInPayoutCurrencyDisplay": "USD 108.28",
        "discount": 0,
        "discountDisplay": "€0.00",
        "discountInPayoutCurrency": 0,
        "discountInPayoutCurrencyDisplay": "USD 0.00",
        "subtotal": 100,
        "subtotalDisplay": "€100.00",
        "subtotalInPayoutCurrency": 108.28,
        "subtotalInPayoutCurrencyDisplay": "USD 108.28",
        "discountDuration": 0,
        "next": 1586304000000,
        "nextValue": 1586304000000,
        "nextInSeconds": 1586304000,
        "nextDisplay": "4/8/20",
        "end": 1554681600000,
        "endValue": 1554681600000,
        "endInSeconds": 1554681600,
        "endDisplay": "4/8/19",
        "canceledDate": 1554681600000,
        "canceledDateValue": 1554681600000,
        "canceledDateInSeconds": 1554681600,
        "canceledDateDisplay": "4/8/19",
        "deactivationDate": null,
        "deactivationDateValue": null,
        "deactivationDateInSeconds": null,
        "deactivationDateDisplay": null,
        "sequence": 1,
        "periods": 0,
        "remainingPeriods": 0,
        "begin": 1554681600000,
        "beginValue": 1554681600000,
        "beginInSeconds": 1554681600,
        "beginDisplay": "4/8/19",
        "intervalUnit": "year",
        "intervalLength": 1,
        "paymentReminder": {
          "intervalUnit": "month",
          "intervalLength": 1
        },
        "paymentOverdue": {
          "intervalUnit": "week",
          "intervalLength": 1,
          "total": 4,
          "sent": 0
        },
        "cancellationSetting": {
          "cancellation": "AFTER_LAST_NOTIFICATION",
          "intervalUnit": "week",
          "intervalLength": 1
        },
        "instructions": [
          {
            "product": "falcon-plus-annual-subscription-individual-license",
            "type": "regular",
            "periodStartDate": null,
            "periodStartDateValue": null,
            "periodStartDateInSeconds": null,
            "periodStartDateDisplay": null,
            "periodEndDate": 1554681600000,
            "periodEndDateValue": 1554681600000,
            "periodEndDateInSeconds": 1554681600,
            "periodEndDateDisplay": "4/8/19",
            "intervalUnit": "year",
            "intervalLength": 1,
            "discountPercent": 0,
            "discountPercentValue": 0,
            "discountPercentDisplay": "0%",
            "discountTotal": 0,
            "discountTotalDisplay": "€0.00",
            "discountTotalInPayoutCurrency": 0,
            "discountTotalInPayoutCurrencyDisplay": "USD 0.00",
            "unitDiscount": 0,
            "unitDiscountDisplay": "€0.00",
            "unitDiscountInPayoutCurrency": 0,
            "unitDiscountInPayoutCurrencyDisplay": "USD 0.00",
            "price": 100,
            "priceDisplay": "€100.00",
            "priceInPayoutCurrency": 108.28,
            "priceInPayoutCurrencyDisplay": "USD 108.28",
            "priceTotal": 100,
            "priceTotalDisplay": "€100.00",
            "priceTotalInPayoutCurrency": 108.28,
            "priceTotalInPayoutCurrencyDisplay": "USD 108.28",
            "unitPrice": 100,
            "unitPriceDisplay": "€100.00",
            "unitPriceInPayoutCurrency": 108.28,
            "unitPriceInPayoutCurrencyDisplay": "USD 108.28",
            "total": 100,
            "totalDisplay": "€100.00",
            "totalInPayoutCurrency": 108.28,
            "totalInPayoutCurrencyDisplay": "USD 108.28"
          }
        ]
      }
    }
  ]
}